
## Plan Result (live/prd/ec2/t-type)


[CI link](https://github.com/EunyoungPark327/terragrunt/actions/runs/19404226420)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_instance.this[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0c9c942bd7bf113a2"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = true
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "EC2RoleforSSM"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "ec2-prd-key"
      + monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "ap-northeast-2"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0f9f6702de3c40153"
      + tags                                 = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "devops-ec2-prd"
          + "Team"        = "DevOps"
        }
      + tags_all                             = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "devops-ec2-prd"
          + "Team"        = "DevOps"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "devops-ec2-prd"
          + "Team"        = "DevOps"
        }
      + vpc_security_group_ids               = [
          + "sg-04d7644aa5406dfa8",
        ]

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + credit_specification {
          + cpu_credits = "standard"
        }

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + primary_network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp3"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + credit_specification = [
      + {
          + cpu_credits = "standard"
        },
    ]
  + id                   = (known after apply)
  + private_ip           = (known after apply)
  + public_ip            = (known after apply)
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":2,"Program":"tfcmt","SHA1":"b8ee7a0ec9e1498467fc7300e9b56a0ac4a6a304","Target":"live/prd/ec2/t-type/.terragrunt-cache/KLHccMMDThzpG6aw7X6MLMRlfwc/Fs2ISkx1dcXVz_QqRtlTK97GZTI","Vars":{"target":"live/prd/ec2/t-type/.terragrunt-cache/KLHccMMDThzpG6aw7X6MLMRlfwc/Fs2ISkx1dcXVz_QqRtlTK97GZTI"},"WorkflowName":"Terragrunt Plan"} -->